Revit 2027 API
CircleLightShape(CircleLightShape) Constructor
 Creates a copy of the given circle light shape
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public CircleLightShape(
	CircleLightShape other
)
Public Sub New (
	other As CircleLightShape
)
public:
CircleLightShape(
	CircleLightShape^ other
)
new :
        other : CircleLightShape -> CircleLightShape
Parameters
other CircleLightShape
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
CircleLightShape Class
CircleLightShape Overload
Autodesk.Revit.DB.Lighting Namespace